Merge branch 'chore/cleanup-and-readme'
